In [ ]:
pip install sqlalchemy psycopg2 pandas

# Connecting to Postgres

In [19]:
from sqlalchemy import create_engine

In [ ]:
engine = create_engine ("postgresql://username:password@localhost:port/dbname")

In [44]:
import pandas as pd

In [45]:
df = pd.read_csv('weight-height-updated.csv')
df.head()

  Gender     Height      Weight  Born_Year
0   Male  73.847017  241.893563     1967.0
1   Male  68.781904  162.310473     1977.0
2   Male  74.110105  212.740856     1991.0
3   Male  71.730978  220.042470     1998.0
4   Male  69.881796  206.349801     1985.0

In [46]:
from sqlalchemy import create_engine

In [59]:
df_1 = pd.read_sql("SELECT * FROM course_management.students", engine)
df_1.head()

   student_id first_name last_name                   email date_of_birth
0           1     Martin    Otieno  otienomartin@gmail.com    1994-06-24
1           2      Kevin     Omolo  otienomartin@gmail.com    1994-06-24
2           3       John    Wafula  otienomartin@gmail.com    1996-11-10
3           4        Liz    Wambui    wambui2025@gmail.com    1990-12-12
4           5    William     Kamau  kamauwilliam@gmail.com    1994-07-12

In [60]:
df_1 = pd.read_sql("SELECT * FROM course_management.students", engine)
df_1.tail()

    student_id first_name last_name                    email date_of_birth
11          12     Selina   Wakesho   otienomartin@gmail.com    1997-04-29
12          13       Mary   Wanjiru    wanjirumary@gmail.com    1995-02-16
13          14        Eve    Sharon       sharon45@gmail.com    1980-01-20
14          15    Pauline    Fatuma  fatumapauline@gmail.com    1991-08-12
15          16     Cythia    Kerubo   kerubocythia@gmail.com    1990-10-01

# Exploratory data analysis

In [53]:
df_1 = pd.read_sql("SELECT * FROM course_management.students", engine)
df_1.describe()

       student_id
count   16.000000
mean     8.500000
std      4.760952
min      1.000000
25%      4.750000
50%      8.500000
75%     12.250000
max     16.000000

In [57]:
df_1 = pd.read_sql("SELECT * FROM course_management.students", engine)
df_1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   student_id     16 non-null     int64
 1   first_name     16 non-null     object
 2   last_name      16 non-null     object
 3   email          16 non-null     object
 4   date_of_birth  16 non-null     object
dtypes: int64(1), object(4)
memory usage: 772.0+ bytes